/**
 * 并查集经典题目 -- 岛问题
 *
 * 给你一个大小为 m*n 的二进制矩阵 grid, 1 代表土地，0 代表水。
 * `岛屿`是由一些相邻的 1 构成的组合，这里的`相邻`要求两个 1 必须在 水平或者竖直的四个方向上相邻，假设 grid 的四个边缘都被 0 包围着。
 * 给定 grid，返回岛屿的数量。
 *
 * 比如, grid 是:
 * [
 *   [0,0,1,0],
 *   [0,0,0,0],
 *   [0,1,1,0],
 *   [0,1,0,0],
 * ]
 *
 * 那么要返回 2, 因为有 2 座岛屿:
 *
 *      第 1 座岛:
 *      x x 1 x
 *      x x x x
 *      x x x x
 *      x x x x
 *
 *      第 2 座岛:
 *      x x x x
 *      x x x x
 *      x 1 1 x
 *      x 1 x x
 *
 *
 * 测试链接:
 * https://leetcode.cn/problems/number-of-islands/
 *
*/

function numIslands() {}
